# Parameters
nc: 17
depth_multiple: 0.33
width_multiple: 0.50
task: detect

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f, [128, True]]    # 2
  - [-1, 1, AKConv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]    # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]   # 8
  - [-1, 1, SPPFCSPC, [1024]]    # 9
  - [-1, 1, CoordAtt, [512, 16]] # 10

head:
  - [4, 1, Conv, [256]]     # 11 (P3/8)
  - [6, 1, Conv, [256]]     # 12 (P4/16)
  - [10, 1, Conv, [256]]    # 13 (P5/32)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 12], 1, BiFPN, []]  # 15
  - [-1, 3, C2f, [256]]       # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 17
  - [[-1, 11], 1, BiFPN, []]  # 18
  - [-1, 3, C2f, [256]]       # 19

  - [1, 1, Conv, [256, 3, 2]]   # 20
  - [[20, 11, 19], 1, BiFPN, []]  # 21
  - [-1, 3, C2f, [128]]        # 22

  - [-1, 1, Conv, [256, 3, 2]]   # 23
  - [[-1, 12, 16], 1, BiFPN, []]  # 24
  - [-1, 3, C2f, [256]]        # 25

  - [-1, 1, Conv, [256, 3, 2]]   # 26
  - [[-1, 13], 1, BiFPN, []]     # 27
  - [-1, 3, C2f, [512]]        # 28

  - [[22, 25, 28], 1, Detect, [nc]]  # Detect(P3, P4, P5)