# yolov8s-optimized.yaml
nc: 18
depth_multiple: 0.33
width_multiple: 0.50

backbone:
  [[-1, 1, Conv, [64, 3, 2]],
  [-1, 1, Conv, [128, 3, 2]],
  [-1, 3, C2f, [128, True]],
  [-1, 1, CBAM, [128]],         # 在C2f后添加注意力
  [-1, 1, Conv, [256, 3, 2]],
  [-1, 6, C2f, [256, True]],
  [-1, 1, CoordAtt, [256, 256]],
  [-1, 1, Conv, [512, 3, 2]],
  [-1, 6, C2f, [512, True]],
  [-1, 1, SE, [512]],
  [-1, 1, Conv, [1024, 3, 2]],
  [-1, 3, C2f, [1024, True]],
  [-1, 1, CBAM, [1024]],

head:
  [[-1, 1, SPPF, [1024, 5]],
   [-1, 1, C2f, [1024, False]],
   [-1, 1, CoordAtt, [1024, 1024]],

   [7, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],
   [-1, 3, C2f, [512, False]],
   [-1, 1, CBAM, [512]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],
   [-1, 3, C2f, [256, False]],
   [-1, 1, SE, [256]],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 13], 1, Concat, [1]],
   [-1, 3, C2f, [512, False]],
   [-1, 1, CoordAtt, [512, 512]],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 8], 1, Concat, [1]],
   [-1, 3, C2f, [1024, False]],
   [-1, 1, CBAM, [1024]],

   [[17, 20, 23], 1, Detect, [nc, True]],  # 增强检测头
   ]